Documents/ESB/ESB_Consumer_1023/003TestSample/SAMPLE_XML_MUST/CustomerTax/CT06_FATCAAddRq.xml

<?xml version="1.0" encoding="utf-8"?>

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:v1="http://www.iisigroup.com/magiclamp/common/soapenv.xsd/v1" xmlns:v11="http://www.nextbank.com.tw/xsd/TW/CustomerTax/FATCAAddRq/v1">  
  <soap:Header> 
    <v1:Header v1:mustUnderstand="true"> 
      <ChannelID>ESB</ChannelID>  
      <ServiceDomain>CustomerTax</ServiceDomain>  
      <OperationName>FATCAAdd</OperationName>  
      <ConsumerID>TWESB</ConsumerID>  
      <TransactionID>T1222222</TransactionID>  
      <RqTimestamp>2015-12-06T12:01:01.00+08:00</RqTimestamp> 
    </v1:Header> 
  </soap:Header>  
  <soap:Body> 
    <v11:FATCAAddRq> 
      <v11:ServiceHeader> 
        <v11:TxnId>CT06</v11:TxnId>  
        <v11:TxnNo>CT0600001</v11:TxnNo> 
      </v11:ServiceHeader>  
      <v11:Signon> 
        <v11:CustId>ESBUSER</v11:CustId> 
      </v11:Signon>  
      <v11:ServiceBody> 
        <!--Optional:-->  
        <v11:ValidateOnly>false</v11:ValidateOnly>  
        <v11:CIFNo>1000000004</v11:CIFNo>  
        <v11:CustType>Individual</v11:CustType>  
        <v11:BirthDayFlg>NO</v11:BirthDayFlg>  
        <v11:Res>JP</v11:Res>  
        <!--1 or more repetitions:-->  
        <v11:NatlRec> 
          <v11:Natl>TW</v11:Natl> 
        </v11:NatlRec>  
        <v11:TaxRes>TW</v11:TaxRes>  
        <!--1 or more repetitions:-->  
        <v11:TINRec> 
          <v11:TINCntry>JP</v11:TINCntry>  
          <v11:TINCode>ADJP112300502</v11:TINCode> 
        </v11:TINRec>  
        <!--Zero or more repetitions:-->  
        <v11:OwnrRec></v11:OwnrRec>  
        <!--Zero or more repetitions:-->  
        <v11:JointAcctRec></v11:JointAcctRec>  
        <v11:FATCAStat>NON.US.ACCOUNT</v11:FATCAStat>  
        <v11:StatChngDate>20200103</v11:StatChngDate>  
        <!--Zero or more repetitions:-->  
        <v11:NoTINRec></v11:NoTINRec>  
        <!--Zero or more repetitions:-->  
        <v11:FATCAAddr></v11:FATCAAddr>  
        <!--Zero or more repetitions:-->  
        <v11:NatlInfo> 
          <!--Optional:-->  
          <v11:Natl>US</v11:Natl>  
          <!--Optional:-->  
          <v11:CustName>MEI-MEI,WANG</v11:CustName> 
        </v11:NatlInfo>  
        <!--Optional:-->  
        <v11:APIKey>NCB-IF99002</v11:APIKey> 
      </v11:ServiceBody> 
    </v11:FATCAAddRq> 
  </soap:Body> 
</soap:Envelope>
